Cases/container/carrier_solid/0.org/airInside/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    "airInside_to_battery.*"
    {
        type            kqRWallFunction;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    airInside_to_carrier
    {
        type            kqRWallFunction;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    trailer
    {
        type            kqRWallFunction;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
}


// ************************************************************************* //
