Cases/container/carrier_solid/0.org/battery_template/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    ".*"
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;            
        Tnbr            T;
        thicknessLayers (0.01);
        kappaLayers     (0.5);
        kappaMethod     solidThermo;
        value           $internalField;
    }
}

// ************************************************************************* //
